Revit 2027 API
ParameterTypeId.StructuralAttachmentBaseReferencedend Property
 "Base Attachment Referenced End"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentBaseReferencedend { get; }
Public Shared ReadOnly Property StructuralAttachmentBaseReferencedend As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentBaseReferencedend {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentBaseReferencedend : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace